Repository: Ivan32232/Ghost-chat
Catalog: GhostChat-iOS/GhostChat/Resources/*.lproj/Localizable.strings
Languages: ru

# welcome.subtitle
source: Private messenger
ru: Приватный мессенджер

# welcome.newChat
source: New chat
ru: Новый чат

# welcome.creating
source: Creating...
ru: Создаём...

# welcome.or
source: or
ru: или

# welcome.roomCode
source: Room code
ru: Код комнаты

# welcome.join
source: Join
ru: Войти

# welcome.joining
source: Joining...
ru: Входим...

# welcome.hideIP
source: Hide IP (relay)
ru: Скрыть IP (relay)

# welcome.footer
source: Messages are not stored on the server
ru: Сообщения не хранятся на сервере

# waiting.title
source: Waiting for peer
ru: Ожидание собеседника

# waiting.copy
source: Copy
ru: Скопировать

# waiting.share
source: Share
ru: Поделиться

# waiting.shareMessage
source: Join private chat
ru: Присоединяйся к приватному чату

# waiting.cancel
source: Cancel
ru: Отмена

# connecting.title
source: Connecting...
ru: Подключение...

# connecting.subtitle
source: Establishing P2P connection
ru: Устанавливаем P2P соединение

# connecting.cancel
source: Cancel
ru: Отмена

# chat.message
source: Message
ru: Сообщение

# chat.securityCode
source: Security code
ru: Код безопасности

# chat.compareCode
source: Compare this code with your peer through another channel
ru: Сравните этот код с собеседником через другой канал связи

# chat.matches
source: Matches
ru: Совпадает

# chat.doesNotMatch
source: Doesn't match
ru: Не совпадает

# call.calling
source: Calling...
ru: Звоним...

# call.unmute
source: Unmute
ru: Вкл. микрофон

# call.mute
source: Mute
ru: Выкл. микрофон

# call.speaker
source: Speaker
ru: Динамик

# call.earpiece
source: Earpiece
ru: На ухо

# call.end
source: End
ru: Завершить

# call.incoming
source: Incoming call
ru: Входящий звонок

# call.accept
source: Accept
ru: Принять

# call.decline
source: Decline
ru: Отклонить

# system.peerDisconnected
source: Peer disconnected
ru: Собеседник отключился

# system.connectionRestored
source: Connection restored
ru: Соединение восстановлено

# system.connectionLost
source: Connection lost
ru: Соединение потеряно

# system.secureConnection
source: Secure connection established
ru: Защищённое соединение установлено

# system.tapShield
source: Tap the shield to verify security codes
ru: Нажмите на щит для сверки кодов безопасности

# system.keyExchangeError
source: Key exchange error
ru: Ошибка обмена ключами

# system.screenshotTaken
source: ⚠️ You took a screenshot
ru: ⚠️ Вы сделали скриншот

# system.decryptionError
source: Decryption error
ru: Ошибка расшифровки

# system.sendError
source: Send error
ru: Ошибка отправки

# system.calling
source: Calling...
ru: Звоним...

# system.incomingCall
source: Incoming call...
ru: Входящий звонок...

# system.callConnected
source: Call connected
ru: Звонок подключён

# system.callDeclined
source: Call declined
ru: Звонок отклонён

# system.callStarted
source: Call started
ru: Звонок начат

# system.callEnded
source: Call ended
ru: Звонок завершён

# system.peerEndedCall
source: Peer ended the call
ru: Собеседник завершил звонок

# system.peerScreenshot
source: Peer took a screenshot
ru: Собеседник сделал скриншот

# system.verified
source: Verified! Connection is secure.
ru: Подтверждено! Соединение безопасно.

# system.codesDoNotMatch
source: WARNING: Codes DON'T match! Possible attack!
ru: ВНИМАНИЕ: Коды НЕ совпадают! Возможна атака!

# system.endSession
source: End the session immediately.
ru: Немедленно завершите сессию.

# system.connectionTimeout
source: Connection failed (timeout)
ru: Не удалось подключиться (таймаут)

# system.callError
source: Call error: %@
ru: Ошибка звонка: %@

# system.error
source: Error: %@
ru: Ошибка: %@

# system.pqUpgraded
source: Post-quantum protection active (ML-KEM768)
ru: Пост-квантовая защита активна (ML-KEM768)

# security.screenRecordingActive
source: Screen recording active
ru: Запись экрана активна

# security.screenRecordingDetected
source: Screen recording detected
ru: Обнаружена запись экрана

# security.bluetoothConnected
source: Bluetooth device connected: %@
ru: Подключено Bluetooth устройство: %@

# security.audioDeviceRemoved
source: Audio device disconnected
ru: Аудио устройство отключено

# signaling.reconnectFailed
source: Failed to reconnect
ru: Не удалось переподключиться

# NSMicrophoneUsageDescription
source: Microphone is required for voice calls
ru: Микрофон необходим для голосовых звонков

# NSCameraUsageDescription
source: Camera may be used for video calls
ru: Камера может использоваться для видеозвонков
